core/app/Http/Controllers/Landlord/Frontend/LandlordFrontendController.php

select * from `pages` where `id` = '1' limit 1
---
    public function homepage()
    {
        $id = get_static_option('home_page');
        $page_post = Page::where('id', $id)->first();