core/plugins/PageBuilder/Addons/Landlord/Common/FeedbackSplitSlider.php

    public function frontend_render()
    {
        $testimonial = Testimonial::where('status', 1)
            ->orderBy('id', 'desc')
            ->take(6)
            ->get();
---
select * from `testimonials` where `status` = 1 order by `id` desc limit 6