core/plugins/PageBuilder/Addons/Landlord/Common/PricePlan.php

select * from `plan_features` where `plan_features`.`plan_id` in (2, 3, 4, 7, 8, 9, 10, 11, 12)
select * from `price_plans` where `status` = 1 order by `id` asc
select distinct `type` from `price_plans` where `status` = 1 order by `type` asc
---
    public function frontend_render()
    {
        $display_style = SanitizeInput::esc_html($this->setting_item('display_style')) ?? 'default';
        $title = SanitizeInput::esc_html($this->setting_item('title')) ?? '';
        $subtitle = SanitizeInput::esc_html($this->setting_item('subtitle')) ?? '';
        $disclaimer_text = SanitizeInput::esc_html($this->setting_item('disclaimer_text')) ?? '';
        $padding_top = SanitizeInput::esc_html($this->setting_item('padding_top'));
        $padding_bottom = SanitizeInput::esc_html($this->setting_item('padding_bottom'));

        $order_by = SanitizeInput::esc_html($this->setting_item('order_by'));
        $order = SanitizeInput::esc_html($this->setting_item('order'));

        // Get price plans and group by type with integer keys
        $price_plans = \App\Models\PricePlan::with('plan_features')
            ->where('status', 1)
            ->orderBy($order_by ?? 'id', $order ?? 'asc')
            ->get();

        // Group by type and ensure integer keys to match pluck values
        $all_price_plan = [];
        foreach ($price_plans as $plan) {
            $type = (int) $plan->type;
            if (!isset($all_price_plan[$type])) {
                $all_price_plan[$type] = [];
            }
            $all_price_plan[$type][] = $plan;
        }

        $plan_types = \App\Models\PricePlan::where('status', 1)
            ->orderBy('type', 'asc')
            ->select('type')
            ->distinct()
            ->pluck('type')
            ->map(function($type) {
                return (int) $type;
            });