core/app/Helpers/funtions.php

function get_static_option($option_name, $default = null)
{
    $value = Cache::remember($option_name, 24 * 60 * 60, function () use ($option_name) {
        try {
            return StaticOption::where('option_name', $option_name)->first();
---
select * from `static_options` where `option_name` = 'popup_selected_en_GB_id' limit 1

function get_static_option_central($option_name, $default = null)
{
    $value = Cache::remember($option_name, 60, function () use ($option_name) {
        try {
            return \App\Models\StaticOptionCentral::where('option_name', $option_name)->first();
---
select * from `static_option_centrals` where `option_name` = 'storage_driver' limit 1

function get_attachment_image_by_id($id, $size = null, $default = false)
{
    $image_details = Cache::remember('media_image_' . $id, 60 * 60 * 24, function () use ($id) {
        return \App\Models\MediaUploader::find($id);
---
select * from `media_uploaders` where `media_uploaders`.`id` is null limit 1

function get_page_slug($id, $default = null)
{
    return \App\Models\Page::where('id', $id)->first()->slug ?? $default;
---
select * from `pages` where `id` is null limit 1